/*
 * 梦境巡查 (patrol)
 * CCF CSP 第36次认证 真题2
 * 时间限制: 1.0秒  内存限制: 512 MiB
 *
 * 题目描述：
 * 梦境中的西西艾弗岛由 n+1 个区域组成。梦境巡查员顿顿每天都会从梦之源出发，
 * 顺次巡查 1,2,...,n 号区域，最后从 n 号区域返回梦之源。
 * 从第 i 号区域前往下一区域需要消耗 ai 单位能量；
 * 顺利到达第 i 号区域后可以汲取 bi 单位能量作为补给。
 * 现在考虑有且仅有一个区域发生意外（bi 变为 0），
 * 求每个区域发生意外时，为顺利完成巡查需要携带的最少初始能量 w(i)。
 *
 * 输入格式：
 * 第一行包含一个整数 n。
 * 第二行包含 n+1 个整数 a0,a1,...,an。
 * 第三行包含 n 个整数 b1,b2,...,bn。
 *
 * 输出格式：
 * 输出一行，包含 n 个整数 w(1),w(2),...,w(n)。
 *
 * 数据范围：
 * 0<n<=10^5 且 0<=ai,bi<=1000。
 *
 * 样例输入1：
 * 3
 * 5 5 5 5
 * 0 100 0
 *
 * 样例输出1：
 * 10 20 10
 *
 * 样例输入2：
 * 3
 * 9 4 6 2
 * 9 4 6
 *
 * 样例输出2：
 * 15 10 9
 */

#include <iostream>
using namespace std;
int main() {

  return 0;
}
