/*
 * 化学方程式配平 (balance)
 * CCF CSP 第33次认证 真题3
 * 时间限制: 1.0秒  内存限制: 512 MiB
 *
 * 题目描述：
 * 给出一些化学方程式，判断它们是否可以配平。
 * 通过构建齐次线性方程组，判断系数矩阵的秩是否小于未知数个数。
 * 化学式已被化简为只包含小写字母和数字的字符串。
 *
 * 输入格式：
 * 第一行正整数 n。
 * 接下来 n 行，每行先输入正整数 m，再输入 m 个化学式字符串。
 *
 * 输出格式：
 * n 行，每行 Y 或 N。
 *
 * 数据范围：
 * 物质个数和元素种数不超过 40，1<=n<=10，原子个数不超过 50。
 *
 * 样例输入：
 * 6
 * 2 o2 o3
 * 3 c1o1 c1o2 o2
 * 2 n2o4 n1o2
 * 4 cu1 h1n1o3 cu1n2o6 h2o1
 * 4 al2s3o12 n1h5o1 al1o3h3 n2h8s1o4
 * 4 c1o1 c1o2 o2 h2o1
 *
 * 样例输出：
 * Y
 * Y
 * Y
 * N
 * Y
 * Y
 */

#include <iostream>
using namespace std;
int main() {

  return 0;
}
