/*
 * 彩色路径 (colorpath)
 * CCF CSP 第32次认证 真题5
 * 时间限制: 1.0秒  内存限制: 512 MiB
 *
 * 题目描述：
 * N 个节点 M 条有向边的图，每个节点有颜色标签 C[i]。
 * 找一条从 0 到 N-1 的简单路径，要求：
 * - 路径上每个节点颜色不同（彩色路径）；
 * - 节点数 <= L；
 * - 最大化路径长度（边的总长度）。
 *
 * 输入格式：
 * 第一行四个正整数 N、M、L、K。
 * 第二行 N 个整数（颜色标签）。
 * 第三行 M 个整数（边的起点）。
 * 第四行 M 个整数（边的终点）。
 * 第五行 M 个整数（边的长度）。
 *
 * 输出格式：
 * 一个数，最大路径长度。
 *
 * 数据范围：
 * 2<=N<=100, 1<=M<=5000, 2<=L<=9<=K<=30, 1<=D[j]<=10^6。
 *
 * 样例输入：
 * 6 9 4 10
 * 0 2 2 3 3 9
 * 0 0 0 1 1 1 2 3 4
 * 1 2 4 3 4 5 4 5 5
 * 1 2 4 3 2 8 5 3 1
 *
 * 样例输出：
 * 9
 */

#include <iostream>
using namespace std;
int main() {

  return 0;
}
