/*
 * 通讯延迟 (delay)
 * CCF CSP 第35次认证 真题4
 * 时间限制: 1.0秒  内存限制: 512 MiB
 *
 * 题目描述：
 * 给定二维平面上 n 个节点和 m 个通讯基站。
 * 第 i 个基站覆盖以 (xi,yi) 为中心、2ri 为边长的正方形区域，
 * 区域内所有节点可以以 ti 单位时间的延迟进行通讯。
 * 求节点 1 到 n 的最短通讯延迟。
 *
 * 输入格式：
 * 第一行两个正整数 n、m。
 * 接下来 n 行每行两个整数（节点坐标）。
 * 接下来 m 行每行四个整数（基站坐标、半径、延迟）。
 *
 * 输出格式：
 * 输出最短通讯延迟；如果无法通讯，输出 Nan。
 *
 * 数据范围：
 * n,m<=5000, 0<=xi,yi,ri<=10^9, 1<=ti<=10^5。
 *
 * 样例输入：
 * 5 5
 * 0 0
 * 2 4
 * 4 0
 * 5 3
 * 5 5
 * 1 2 2 5
 * 3 5 2 6
 * 2 0 2 1
 * 4 2 2 3
 * 5 4 1 2
 *
 * 样例输出：
 * 6
 */

#include <iostream>
using namespace std;
int main() {

  return 0;
}
