/*
 * 平衡数 (balance)
 * CCF CSP 第41次认证 真题1
 * 时间限制: 1.0秒  内存限制: 512 MiB
 *
 * 题目描述：
 * 小P在学习了位运算后，定义了如下"平衡数"：
 * 对于一个正整数a，如果其二进制表示中1和0的个数相等，则称其为平衡数。
 * 这里的二进制表示以1为最高位，即不考虑更高位用于补位的0。
 * 例如，正整数12的二进制表示为1100，包含两个1和两个0。
 * 小P已经生成好了n个正整数a1, a2, ···, an，试编程统计里面有多少个平衡数。
 *
 * 输入格式：
 * 输入的第一行包含一个正整数n，第二行包含空格分隔的n个正整数a1, a2, ···, an。
 *
 * 输出格式：
 * 输出一个整数，表示a1, a2, ···, an中平衡数的个数。
 *
 * 样例输入：
 * 3
 * 2 5 9
 *
 * 样例输出：
 * 2
 *
 * 样例解释：
 * 2的二进制表示为10，是平衡数；
 * 5的二进制表示为101，不是平衡数；
 * 9的二进制表示为1001，是平衡数。
 *
 * 数据范围：
 * 50%的测试点满足：0 < ai ≤ 256；
 * 全部的测试点满足：0 < n ≤ 100且0 < ai ≤ 10^9。
 */

#include <iostream>
using namespace std;

int main() {

    return 0;
}