/*
 * 闪耀巡航 (cruise)
 * CCF CSP 第30次认证 真题5
 * 时间限制: 1.0秒  内存限制: 512 MiB
 *
 * 题目描述：
 * N 条航线用字符串表示，每个字母代表一个目的地。
 * 集章活动要求集齐字符串 t 中所有字母。
 * 对每条航线 si，求从 si 起点出发搭乘 si，
 * 再经过若干航线完成集章后返回起点的最小总长度。
 *
 * 输入格式：
 * 第一行正整数 N 和字符串 t。
 * 接下来 N 行每行一个字符串。
 *
 * 输出格式：
 * N 行，每行一个整数或 -1。
 *
 * 数据范围：
 * 1<=N<=10^5, 1<=|t|<=10, 2<=|si|<=10^6, Σ|si|<=10^6。
 *
 * 样例输入：
 * 6 au
 * aqua
 * glass
 * hug
 * shiny
 * sparkling
 * youth
 *
 * 样例输出：
 * 3
 * 14
 * 14
 * 14
 * 26
 * 14
 */

#include <iostream>
using namespace std;
int main() { return 0; }
